app/controllers/admins_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def index
		if session[:user_id]
			a=Admin.find(session[:user_id])
			if (a.blank?)
				return redirect_to action: 'sign_in'
			end
			@signed_in_admin =Admin.find(session[:user_id])

SELECT  "admins".* FROM "admins" WHERE "admins"."username" = ? AND "admins"."password" = ? LIMIT ?  [["username", "admin"], ["password", "1234567"], ["LIMIT", 1]]
---
	def create_session
		a=Admin.find_by(username: params[:username], password: params[:password])

SELECT  "fields".* FROM "fields" ORDER BY "fields"."id" ASC LIMIT ?  [["LIMIT", 1]]
UPDATE "fields" SET "num" = ?, "updated_at" = ? WHERE "fields"."id" = ?  [["num", 0], ["updated_at", "2018-09-06 20:26:54.257075"], ["id", 1]]
---
	def add_assignment
		if session[:user_id].blank?
		 	redirect_to action: 'index'
		 end
		 @n1=Field.first
		 @n=@n1.num
		 @n=0
		 @n1.num=@n
		 @n1.save

SELECT  "fields".* FROM "fields" ORDER BY "fields"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "mods".* FROM "mods" WHERE "mods"."name" = ? LIMIT ?  [["name", "Introduction To Computers"], ["LIMIT", 1]]
INSERT INTO "questions" ("mod_id", "answer", "option1", "option2", "option3", "created_at", "updated_at", "ques") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def assignment_create
		if session[:user_id].blank?
		 	redirect_to action: 'index'
		 end
		last=Field.first.num
		mod=Mod.find_by_name(params[:mod_name])
		modi=mod.id
		for i in 1..last
			Question.create(mod_id: modi,ques: params["ques-#{i}".to_sym],option1: params["option1-q#{i}".to_sym],option2: params["option2-q#{i}".to_sym],option3: params["option3-q#{i}".to_sym],answer:params["ans-#{i}".to_sym],queshin:params["queshin-#{i}".to_sym],option1hin:params["option1hin-q#{i}".to_sym],option2hin:params["option2hin-q#{i}".to_sym],option3hin:params["option3hin-q#{i}".to_sym])

SELECT  "fields".* FROM "fields" ORDER BY "fields"."id" ASC LIMIT ?  [["LIMIT", 1]]
UPDATE "fields" SET "num" = ?, "updated_at" = ? WHERE "fields"."id" = ?  [["num", 1], ["updated_at", "2018-09-10 17:24:45.540056"], ["id", 1]]
---
	def question_create
		if session[:user_id].blank?
		 	redirect_to action: 'index'
		 end
		 @n1=Field.first
		 @n=@n1.num
		 @n=@n+1
		 @n1.num=@n
		 @n1.save