app/controllers/users_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."mod_id" = ?  [["mod_id", 1]]
---
	def Assignment
		@results=Result.where(user_id:current_user.id,mod_id:params[:id])
		if(!@results.blank?)
			return redirect_to action:'result_show',uid:current_user.id,mid:params[:id]
		end
		@questions=Question.where(mod_id: params[:id])

SELECT "questions".* FROM "questions" WHERE "questions"."mod_id" = ?  [["mod_id", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "results" ("user_id", "mod_id", "ans_marked", "question_id", "created_at", "updated_at", "correct") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 1], ["mod_id", 1], ["ans_marked", "B"], ["question_id", 1], ["created_at", "2018-09-10 18:45:37.051170"], ["updated_at", "2018-09-10 18:45:37.051170"], ["correct", 1]]
---
	def result_create
		q=Question.where(mod_id: params[:mod_id]).length
		for i in 1..q
			quesFind=Question.find(params["ques_id-#{i}".to_sym])
			if(quesFind.answer==params["ques-#{i}".to_sym])
				corr=1
			else
				corr=0
			end

			Result.create(user_id: current_user.id, question_id: params["ques_id-#{i}".to_sym], mod_id: params[:mod_id], ans_marked: params["ques-#{i}".to_sym],correct: corr)

SELECT "results".* FROM "results" WHERE "results"."user_id" = ? AND "results"."mod_id" = ?  [["user_id", 1], ["mod_id", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."mod_id" = ?  [["mod_id", 1]]
SELECT "results".* FROM "results" WHERE "results"."user_id" = ? AND "results"."mod_id" = ? AND "results"."correct" = ?  [["user_id", 1], ["mod_id", 1], ["correct", 1]]
---
	def result_show
		@results=Result.where(user_id:params[:uid],mod_id:params[:mid])
		if(@results.blank?)
			redirect_to action: 'dashboard'
		end
		@questions=Question.where(mod_id: params[:mid])
		@correctAns=Result.where(user_id:params[:uid],mod_id:params[:mid],correct: 1).length